; domain
(define (domain vacuum-robot)
  (:requirements :strips :typing)
  (:types robot room)
  (:predicates
    (at ?r - robot ?p - room)
    (dirty ?p - room)
    (clean ?p - room)
  )
  (:action move
    :parameters (?r - robot ?from - room ?to - room)
    :precondition (at ?r ?from)
    :effect (and (not (at ?r ?from)) (at ?r ?to))
  )
  (:action vacuum
    :parameters (?r - robot ?p - room)
    :precondition (and (at ?r ?p) (dirty ?p))
    :effect (and (clean ?p) (not (dirty ?p)))
  )
)

; problem
(define (problem clean-all-rooms)
  (:domain vacuum-robot)
  (:objects
    robot - robot
    pokoj1 pokoj2 pokoj3 - room
  )
  (:init
    (at robot pokoj1)
    (dirty pokoj1)
    (dirty pokoj2)
    (dirty pokoj3)
  )
  (:goal
    (and (clean pokoj1) (clean pokoj2) (clean pokoj3))
  )
)

; plan
1. (vacuum robot pokoj1)
   deleted: (dirty pokoj1)
   added: (clean pokoj1)
   goals met: 1 of 3
2. (move robot pokoj1 pokoj3)
   deleted: (at robot pokoj1)
   added: (at robot pokoj3)
   goals met: 1 of 3
3. (vacuum robot pokoj3)
   deleted: (dirty pokoj3)
   added: (clean pokoj3)
   goals met: 2 of 3
4. (move robot pokoj3 pokoj2)
   deleted: (at robot pokoj3)
   added: (at robot pokoj2)
   goals met: 2 of 3
5. (vacuum robot pokoj2)
   deleted: (dirty pokoj2)
   added: (clean pokoj2)
   goals met: 3 of 3
